//Задание 18_1
let a1 = 10;
let b1 = 2;

alert('task18 ' + a1+b1)
alert('task18 ' + a1-b1)
alert('task18 ' + a1*b1)
alert('task18 ' + a1/b1)

//Задание 18_2
let c = 10;
let d = 5;
let result= c + d;

alert('task18 ' + result)

//Задание 18_3
let a3 = 1;
let b3 = 2;
let c3 = 3;

alert('task18 ' + a3+b3+c3)

//Задание 18_4
let a4 = 10;
let b4 = 5;
let c4 = a4 - b4;
let d4 = 7;
let result4 = c4 + d4;

alert('task18 ' + result4);

// Задание 19 
// let a = 5 + 5 * 3;
// alert(a);
// Результат выведния будет = 20

// let a = 5 + 5 * 3 + 3;
// alert(a);
// Результат выведния будет = 23

// let a = 8 / 2 + 2;
// alert(a);
// Результат выведния будет = 6

// let a = 8 + 2 / 2;
// alert(a);
// Результат выведния будет = 9

// Задание 20 
// let a = 8 / 2 * 2;
// alert(a);
// Результат выведния будет = 8

// let a = 8 * 4 / 2 / 2
// alert(a);
// Результат выведния будет = 4

//Задание 21
// let a = (2 + 3) * (2 + 3);
// alert(a);
// Результат выведния будет = 25

// let a = (2 + 3) * 2 + 3;
// alert(a);
// Результат выведния будет = 15

// let a = 2 * (2 + 4 * (3 + 1));
// alert(a);
// Результат выведния будет = 36

// let a = 2 * 8 / 4;
// alert(a);
// Результат выведния будет = 4

// let a = let a = (2 * 8) / 4;
// alert(a);
// Результат выведния будет = 4

//let a = 2 * (8 / 4);
// alert(a);
// Результат выведния будет = 4
